Процедура ПолучитьБанкПоНаименованию(Наименование)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Банки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	Банки.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Справочники.Банки.НайтиПоНаименованию(Наименование));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецПроцедуры  


Процедура ПолучитьВзаиморасчеты()

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Взаиморасчеты.Период КАК Период,
		|	Взаиморасчеты.Регистратор.Номер КАК Номер,
		|	Взаиморасчеты.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	КонецЦикла;
		

КонецПроцедуры      


 Процедура ПолучитьНоменклатуруТоварныхЗапасов()
	 
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	Справочник.Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТоварныеЗапасыОстатки.Товар КАК Товар,
		|			ТоварныеЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|		ИЗ
		|			РегистрНакопления.ТоварныеЗапасы.Остатки(&Дата, ) КАК ТоварныеЗапасыОстатки) КАК ВложенныйЗапрос
		|		ПО Товары.Ссылка = ВложенныйЗапрос.Товар";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатЗапроса = РезультатЗапроса.Выгрузить();
	
	Возврат  РезультатЗапроса
	
 
 КонецПроцедуры
 

